#------------------------------------------------------------------------
age = 22 # int (целые числа)
# #Вопрос 1: Какой диапозон у int?
"""

"""
#------------------------------------------------------------------------
fraction = 2.5  # float (дробные числа) #Вопрос 2: Какой диапозон для float?
#------------------------------------------------------------------------
name = 'Andrew'  # str (строки)
#-------------------------------------------------------------------------
isStudent = False  # bool True или False
#-------------------------------------------------------------------------
# Пример ошибки объявления переменной:
#1september = '1 september' # Имена переменных не могут начинаться с цифры
#print(1september)
