name = input()  # Вопрос 4: почему такой подход не желателен?
print('Привет ' + name)

# name = input('Введите своё имя: ') # принимает единственный параметр
# print('Привет, ' + name)

number1 = input('Введите первое число: ')
number2 = input('Введите второе число: ')
print(number1 + number2) # Вопрос 5: Почему такой результат?

# Исправленная сумма двух чисел
# number1 = int(input('Введите первое число: '))
# number2 = int(input('Введите второе число: '))
# print(number1 + number2)